const NAMES_STRING =
  "Авдей,Авксентий,Агапит,Агафон,Акакий,Акиндин,Александр,Алексей,Альберт,Альвиан,Анатолий,Андрей,Аникита,Антон,Антонин,Анфим,Аристарх,Аркадий,Арсений,Артём,Артемий,Артур,Архипп,Афанасий,Богдан,Борис,Вавила,Вадим,Валентин,Валерий,Валерьян,Варлам,Варсонофий,Варфоломей,Василий,Венедикт,Вениамин,Викентий,Виктор,Виссарион,Виталий,Владимир,Владислав,Владлен,Влас,Всеволод,Вячеслав,Гавриил,Галактион,Геласий,Геннадий,Георгий,Герасим,Герман,Германн,Глеб,Гордей,Григорий,Данакт,Даниил,Демид,Демьян,Денис,Дмитрий,Добрыня,Донат,Дорофей,Евгений,Евграф,Евдоким,Евсей,Евстафий,Егор,Емельян,Еремей,Ермолай,Ерофей,Ефим,Ефрем,Ждан,Зиновий,Иакинф,Иван,Игнатий,Игорь,Изот,Илья,Иннокентий,Ираклий,Ириней,Исидор,Иуда,Иулиан,Капитон,Ким,Кир,Кирилл,Климент,Кондрат,Конон,Константин,Корнилий,Кузьма,Куприян,Лаврентий,Лев,Леонид,Леонтий,Логгин,Лука,Лукий,Лукьян,Магистриан,Макар,Максим,Мамонт,Марк,Мартын,Матвей,Мелентий,Мина,Мирослав,Митрофан,Михаил,Мстислав,Назар,Нестор,Никандр,Никанор,Никита,Никифор,Никодим,Николай,Никон,Олег,Онисим,Онуфрий,Павел,Паисий,Панкратий,Пантелеймон,Парфений,Пафнутий,Пахомий,Пётр,Платон,Поликарп,Порфирий,Потап,Пров,Прокопий,Протасий,Прохор,Разумник,Родион,Родослав,Роман,Ростислав,Руслан,Савва,Савелий,Самуил,Святополк,Святослав,Севастьян,Семён,Серафим,Сергей,Сила,Сильвестр,Созон,Софрон,Спиридон,Станислав,Степан,Тарас,Тимофей,Тимур,Тит,Тихон,Трифон,Трофим,Урбан,Фаддей,Фёдор,Федосей,Федот,Феликс,Феоктист,Филат,Филимон,Филипп,Фирс,Фока,Фома,Фотий,Фрол";

const NAMES = NAMES_STRING.split(",");

const SURNAMES_STRING =
  "Абрамович,Аверинцев,Авраменко,Адамс,Аккерман,Аксаков,Алейников,Алексеева,АлексейМитрофанов,Алиев,Амин,Андреев,Антокольский,Армстронг,Ашлаг,Бабкин,Бабушкин,Барнс,Баталов,Бах,Белинский,Белов,Бёрк,Берн,Бёрнс,Берроуз,Бехтерев,Блок,Блюменфельд,Богомолов,Богословский,Бойко,БорисИоффе,Браун,Бронте,Бронштейн,Булгаков,Бунин,Буш,Быков,Бэкон,Васильев,Вашингтон,Вебер,Вирт,Вишневский,Вольф,Ворошилов,Гайдн,Ганди,Гачев,Герберт,Гинзбург,Глазунов,Глинка,Гоголь,Гонкур,Гофман,Григорьев,Грин,Гроза,Грум-Гржимайло,Гумбольдт,Гумилёв,Гусев,Даль,Дарвин,Дворжак,Декурсель,Дефо,Джеймс,Джексон,Джонсон,Дзержинский,Дмитриев,Дункан,Дымарский,Дюма,Ерофеев,Ерохин,Ефремов,Жадан,Жуандо,Жуковский,Зайцев,Звягинцев,Зубков,Зыкина,Иванов,Калугин,Капица,Карнеги,Картер,Кашин,Керри,Керсновский,Кинг,Киреевский,Клинтон,Кнут,Козлов,Кочетков,Краснов,Крылов,Крым,Крючков,Кюри,Лавров,Лайтман,Лебедь,Леонов,Леонтьев,Либкнехт,Любарская,Любарский,Любимов,Май,Майков,Максимов,Манн,Маркс,Масляков,Мень,Миллер,Минин,Миронов,Мистраль,Митрофанов,Михалков,Морозов,Мур,Мурадов,Найт,Нартов,Некрасов,Немцов,Новгородцев,Образцова,Олейник,Олейников,Островский,Павлов,Паркер,Перес,Песков,Питт,Попов,ГавриилПопов,Радд,Райкин,Распутин,Расулзаде,Резерфорд,Рубинштейн,Рузвельт,Рэй,Саакян,Савояров,Сергеев,Сидоров,Скотт,Смит,Смышляев,Собчак,Соловьёв,Стивенсон,Суворов,Сумароков,Сухоруков,Тейлор,Тихонов,Тойнби,Толстой,Трауберг,Турчин,Уилсон,Уильямс,Уоттс,Учитель,Уэллс,Фадеев,Файнс,Фармер,Фёдоров,Федотов,Фергюсон,Фишер,Франке,Франко,Фридман,Фрич,Фудель,Хаббард,Хантер,Хилл,Цой,Четвертинский,Чехов,Чудаков,Чуковский";
const SURNAMES = SURNAMES_STRING.split(",");

const PATRONYMICS_STRING =
  "Ааронович,Абрамович,Августович,Авдеевич,Аверьянович,Адамович,Адрианович,Акимович,Аксёнович,Александрович,Алексеевич,Анатольевич,Андреевич,Андроникович,Анисимович,Антипович,Антонович,Ануфриевич,Аркадьевич,Арсенович,Арсеньевич,Артёмович,Артемьевич,Артурович,Архипович,Афанасьевич,Ахматович,Батькович,Бедросович,Бенедиктович,Богданович,Бориславич,Бориславович,Борисович,Борисыч,Брониславович,Ваганович,Вадимович,Валентинович,Валерианович,Валерьевич,Валерьянович,Васильевич,Вахтангович,Венедиктович,Вениаминович,Викентьевич,Викторович,Виленович,Вилорович,Виссарионович,Витальевич,Владиленович,Владимирович,Владиславович,Владленович,Власович,Вольфович,Всеволодович,Вячеславович,Гавриилович,Гаврилович,Гаджиевич,Геннадиевич,Геннадьевич,Генрихович,Георгиевич,Герасимович,Германович,Гертрудович,Глебович,Гордеевич,Григорьевич,Гурьевич,Давидович,Давыдович,Даниилович,Данилович,Демидович,Демьянович,Денисович,Димитриевич,Дмитриевич,Дорофеевич,Евгеньевич,Евграфович,Евдокимович,Евсеевич,Евстигнеевич,Егорович,Елизарович,Елисеевич,Емельянович,Еремеевич,Ермилович,Ермолаевич,Ерофеевич,Ефимович,Ефимьевич,Ефремович,Ефстафьевич,Жанович,Жоресович,Захарович,Захарьевич,Зиновьевич,Ибрагимович,Иванович,Иваныч,Игнатович,Игнатьевич,Игоревич,Измаилович,Изотович,Израилевич,Иларионович,Ильгизович,Ильич,Ильмирович,Ильнурович,Ильсурович,Ильясович,Иоаннович,Иосипович,Иосифович,Исаевич,Исидорович,Каллиникович,Каллистратович,Константинович,Леонидович,Леонович,Леонтьевич,Львович,Магомедович,Магометович,Макарович,Максимилианович,Максимович,Маркович,Матвеевич,Михайлович,Михалыч,Натанович,Наумович,Никандрович,Никанорович,Никитич,Никитович,Никифорович,Никодимович,Николаевич,Никонович,Олегович,Осипович,Павлович,Петрович,Платонович,Прохорович,Романович,Ростиславович,Рудольфович,Русланович,Рустамович,Семёнович,Сергеевич,Сидорович,Сильвестрович,Соломонович,Степанович,Тарасович,Теймуразович,Терентьевич,Тимофеевич,Тимурович,Тихонович,Трифонович,Трофимович,Устинович,Фадеевич,Фёдорович,Федосеевич,Федосьевич,Федотович,Феликсович,Феодосьевич,Феоктистович,Феофанович,Филатович,Филимонович,Филиппович,Фокич,Фомич,Фролович,Харитонович,Харламович,Харлампович,Харлампьевич,Чеславович,Эдгардович";
const PATRONYMICS = PATRONYMICS_STRING.split(",");

const ITEMS = [
  {
    vendorCode: "130C10178R",
    title: "КОМП РЕМ ГРМ (ЗУБЧ)+2 РОЛ",
    price: 50681,
  },
  {
    vendorCode: "130C11551R",
    title: "КОМП РЕМ ГРМ (ЗУБЧ)+2 РОЛ",
    price: 29946,
  },
  {
    vendorCode: "130C17529R",
    title: "КОМП РЕМ ГРМ (ЗУБЧ)+2 РОЛ",
    price: 47721,
  },
  {
    vendorCode: "7701477028",
    title: "КОМП РЕМНЯ ГРМ (ЗУБЧ)+РОЛИК НАТЯЖ 1ШТ",
    price: 10360,
  },
  {
    vendorCode: "7701477024",
    title: "КОМП РЕМНЯ ГРМ 180СМ ЗУ",
    price: 40746,
  },
  {
    vendorCode: "130C13191R",
    title: "КОМПЛ РЕМНЯ ГРМ (РЕМЕНЬ+РОЛ+БОЛТ)",
    price: 82194,
  },
  {
    vendorCode: "130C17480R",
    title: "КОМПЛЕКТ РЕМНЯ ГРМ (РЕМЕНЬ+РОЛИК)",
    price: 29667,
  },
  {
    vendorCode: "2045356",
    title: "Ремень ГРМ (комплект)",
    price: 91446,
  },
  {
    vendorCode: "1672144",
    title: "Ремень ГРМ, Zetec-S",
    price: 80691,
  },
  {
    vendorCode: "1780142",
    title: "Ремень привода ГРМ (комплект с насосом системы охлаждения), Zetec-S / Duratec 1.4/1.6",
    price: 92497,
  },
  {
    vendorCode: "0831R9",
    title: "РЕМКОМПЛЕКТ ГРМ/KIT DISTRIBUT",
    price: 21604,
  },
  {
    vendorCode: "19347444",
    title: "Приводной ремень грм",
    price: 18822,
  },
  {
    vendorCode: "95516740",
    title: "Зубчато-ременная передача грм в сборе",
    price: 25655,
  },
  {
    vendorCode: "081830",
    title: "НАПРАВ ЦЕПИ ГРМ",
    price: 45874,
  },
  {
    vendorCode: "081833",
    title: "НАПРАВ ЦЕПИ ГРМ",
    price: 79505,
  },
  {
    vendorCode: "081840",
    title: "НАПРАВ ЦЕПИ ГРМ",
    price: 45652,
  },
  {
    vendorCode: "210551",
    title: "НАПРАВЛ. ВТУЛКА",
    price: 34202,
  },
  {
    vendorCode: "1766642",
    title: "Натяжитель приводного ремня",
    price: 18293,
  },
  {
    vendorCode: "0829G3",
    title: "НАТЯЖИТЕЛЬ ЦЕПИ",
    price: 73339,
  },
  {
    vendorCode: "2441025001",
    title: "НАТЯЖИТЕЛЬ ЦЕПИ ПРИВОДА ГРМ ИЗГОТОВЛЕНА МЕТОДОМ КРУГЛОГО ПРОКАТА, ТОКА",
    price: 92579,
  },
  {
    vendorCode: "081841",
    title: "успокоитель цепи грм",
    price: 45184,
  },
  {
    vendorCode: "1708273",
    title: "Ремни привода навесных агрегатов (Zetec-S 1.6 100/115, а/м с кондиционером)",
    price: 32311,
  },
  {
    vendorCode: "9677427780",
    title: "ЦЕПЬ ГРМ",
    price: 2464,
  },
  {
    vendorCode: "9822827180",
    title: "Цепь ГРМ KETTE",
    price: 56519,
  },
  {
    vendorCode: "1704089",
    title: "Цепь привода ГРМ, Duratorq TDCI 2.2/2.4",
    price: 97908,
  },
  {
    vendorCode: "06K109158AD",
    title: "Цепь распр.вала AUDI A1 1.4 TFSI [2014-...]",
    price: 83829,
  },
  {
    vendorCode: "545012815R",
    title: "РЫЧАГ ЛЕВЫЙ обновл HS0",
    price: 65065,
  },
  {
    vendorCode: "545011362R",
    title: "РЫЧАГ ПОДВЕСКИ ПЕР ЛЕВ (МЕТ)",
    price: 53557,
  },
  {
    vendorCode: "545019811R",
    title: "РЫЧАГ ПОДВЕСКИ ПЕР ЛЕВ (МЕТ)",
    price: 14771,
  },
  {
    vendorCode: "545004269R",
    title: "РЫЧАГ ПОДВЕСКИ ПЕР ПРАВ (МЕТ)",
    price: 17154,
  },
  {
    vendorCode: "54570BB00A",
    title: "САЙЛЕНТБЛОК РЫЧАГА",
    price: 22815,
  },
  {
    vendorCode: "BTH-1215C",
    title: "Подшипник пер.PEUGEOT BOXER II/CITROEN JUMPER II 06",
    price: 57113,
  },
  {
    vendorCode: "MR272946",
    title: "ПОДШИПНИК СТОЙКИ ПЕРЕДНЕЙ ПОДВЕСКИ",
    price: 96070,
  },
  {
    vendorCode: "AU08385LXLL588",
    title: "Подшипник ступицы FR (AU0838-5LXL/L588) = R170.49",
    price: 31537,
  },
  {
    vendorCode: "40210AX000",
    title: "ПОДШИПНИК СТУПИЦЫ М",
    price: 236,
  },
  {
    vendorCode: "IJ111001",
    title: "ПОДШИПНИК СТУПИЦЫ ПЕРЕДНЕЙ",
    price: 79928,
  },
  {
    vendorCode: "IJ111003",
    title: "ПОДШИПНИК СТУПИЦЫ ПЕРЕДНЕЙ",
    price: 17928,
  },
  {
    vendorCode: "1628922080",
    title: "Колпачки маслосъёмные (комплект)",
    price: 55049,
  },
  {
    vendorCode: "55564395",
    title: "КРЫШКА ГОЛОВКИ БЛОКА ЦИЛИНДРОВ",
    price: 20309,
  },
  {
    vendorCode: "8200575641",
    title: "ОПОРА ДВИГ (МЕТ, РЕЗ)",
    price: 17277,
  },
  {
    vendorCode: "1684286",
    title: "Патрубок системы впуска (гофрированный, Duratec HE)",
    price: 13082,
  },
  {
    vendorCode: "11617501566",
    title: "Регулирующий клапан",
    price: 2079,
  },
  {
    vendorCode: "1920QK",
    title: "РЕГУЛЯТОР",
    price: 38954,
  },
  {
    vendorCode: "0513C8",
    title: "ШЕСТЕРНЯ ГРМ",
    price: 98718,
  },
  {
    vendorCode: "7701478505",
    title: "ШКИВ РАСТРЕДВАЛА (+БОЛТ+КРЫШКА)",
    price: 55159,
  },
  {
    vendorCode: "1628924280",
    title: "электроклапан",
    price: 62480,
  },
  {
    vendorCode: "EK950",
    title: "АКБ EXIDE MICRO-HYBRID A12V 95Ah 850A 353x175x190",
    price: 62956,
  },
  {
    vendorCode: "7711238598",
    title: "АККУМУЛЯТОРНАЯ БАТАРЕЯ L3 70AH/720А",
    price: 83509,
  },
  {
    vendorCode: "0888602305",
    title: "Жидкость АКПП ATF WS 4L",
    price: 33682,
  },
  {
    vendorCode: "S671090312",
    title: "Жидкость гидравлическая ZF LifeguardFluid 8 для АК",
    price: 13188,
  },
  {
    vendorCode: "0310000130",
    title: "ЖИДКОСТЬ ГИДРОУСИЛИТЕЛЯ РУЛЯ МАРКИ GS PSF 4, В ПЛАСТИКОВЫХ КАНИСТРАХ",
    price: 94637,
  },
  {
    vendorCode: "1781003",
    title: "Жидкость ГУР (WSS-M2C204-A2, 1л, зеленая)",
    price: 16788,
  },
  {
    vendorCode: "06161",
    title: "Жидкость ГУР зеленая 1л. синтетика AUDI A2 (8Z0) 1.2 TDI [2001/03-2005/08]",
    price: 6754,
  },
  {
    vendorCode: "4024610",
    title: "ЖИДКОСТЬ ДЛЯ АКПП",
    price: 20349,
  },
  {
    vendorCode: "13455019",
    title: "URANIA DAILY СИНТ 4/5 Л 5W30 КАНИСТРА ПЛАС, ШТ",
    price: 68950,
  },
  {
    vendorCode: "1539424",
    title: "5W40 4л Масло моторное Лукойл Genesis Armortech син",
    price: 6893,
  },
  {
    vendorCode: "36163",
    title: "5W40 XTC SN/CF 5L (синт. моторное масло)",
    price: 62454,
  },
  {
    vendorCode: "104092",
    title: "7100 Ester 4T Моторное масло для 4-Такт SAE 10W-40 (4л)",
    price: 25507,
  },
  {
    vendorCode: "104256",
    title: "8100 X-cess Моторное масло SAE 5W40 (4л)",
    price: 8996,
  },
  {
    vendorCode: "102051",
    title: "8100 X-clean Моторное масло SAE 5W40 (5л)",
    price: 5506,
  },
  {
    vendorCode: "194877",
    title: "ELF 5W40 5L МАСЛО МОТОРНОЕ EVOLUTION 900 SXR  ACEA: A3/B4 API: SN/CF RN0710, RN0700",
    price: 30024,
  },
  {
    vendorCode: "194876",
    title: "EVOLUTION 700 ST Полусинтетическое мотор ное масло SAE 10W-40 (4л) ACEA A3/B4; API SL/CF; VW 501.01",
    price: 16027,
  },
  {
    vendorCode: "194873",
    title: "EVOLUTION 900 NF моторное масло с синтетической технологией SAE 5W-40 (4л) ACEA A3/B4; API SL/CF; VW",
    price: 94679,
  },
  {
    vendorCode: "194875",
    title: "EVOLUTION 900 NF моторное масло с синтетической технологией SAE 5W-40 (4л) ACEA A3/B4; API SL/CF; VW",
    price: 86462,
  },
  {
    vendorCode: "194839",
    title: "EVOLUTION 900 SXR моторное масло с синтетической технологией SAE 5W30 (5л) ACEA A5/B5; API SL/CF; R",
    price: 59210,
  },
  {
    vendorCode: "194878",
    title: "EVOLUTION 900 SXR моторное масло с синтетической технологией SAE 5W-40 (4л) ACEA A3/B4; API SN/CF; R",
    price: 98117,
  },
  {
    vendorCode: "156812",
    title: "Quartz 9000 Energy синтетическое моторное масло SAE 5W40 (5л) ACEA A3/B4; API SМ/CF; VW 502.00/505.0",
    price: 72576,
  },
  {
    vendorCode: "183450",
    title: "Quartz 9000 Future NFC Топливосберегающее моторное масло SAE 5W30 (4л) ACEA A5/B5, A1/B1; API SL/CF;",
    price: 93752,
  },
  {
    vendorCode: "148597",
    title: "Quartz 9000 синтетическое моторное масло SAE 5W40 (4л) ACEA A3/B4; API SМ/CF; NORM PSA PEUGEOT CITRO",
    price: 56779,
  },
  {
    vendorCode: "151510",
    title: "Quartz Ineo ECS синтетическое моторное масло SAE 5W30 (4л) ACEA C2, A5/B5; PSA B 71 2290",
    price: 64619,
  },
  {
    vendorCode: "157103",
    title: "Quartz Ineo MC3 синтетическое моторное масло SAE 5W30 (5л) ACEA C3; API SN/CF; MB 229.31/229.51; BMW",
    price: 58484,
  },
  {
    vendorCode: "175393",
    title: "5W30 QUARTZ 9000 ENERGY HKS G-310 (5L)_масло моторное! ACEA:A5;API: SM,бенз.двиг. KIA-Hyundai",
    price: 35941,
  },
  {
    vendorCode: "194757",
    title: "TRANSELF NFJ Полусинтетическое трансмиссионное масло 1л 75W80 API GL-4+; Renault JXX, TL4, NDX",
    price: 46442,
  },
  {
    vendorCode: "102870",
    title: "Масло 5L",
    price: 63972,
  },
  {
    vendorCode: "MZ320756",
    title: "Масло 5W-30 SM 1л ",
    price: 61963,
  },
  {
    vendorCode: "153692",
    title: "Масло 1 FS 0W40 моторное синтетическое 4л",
    price: 2529,
  },
  {
    vendorCode: "33091qt",
    title: "Масло Mobil ATF 3309 0,946L, Ford WSS-M2C924-A, Toyota JWS 3309, Toyota T-IV, VW G",
    price: 8364,
  },
  {
    vendorCode: "550042847",
    title: "Масло Shell Helix Ultra ECT С3 5W-30 мот. син. (4л) ACEA C3",
    price: 13988,
  },
  {
    vendorCode: "162613",
    title: "Масло ZIC X9 5w40 SN (ACEA A3/B3/B4) 4л (1/4) (универсальное, полностью синт.) / Замена XQ",
    price: 69598,
  },
  {
    vendorCode: "83290429576",
    title: "Масло гидравличесое CHF11S 1Л",
    price: 13092,
  },
  {
    vendorCode: "0821899974",
    title: "Масло мот. ULTRA LTD SN/GF",
    price: 72595,
  },
  {
    vendorCode: "0888010705",
    title: "Масло моторное SN/GF-5 5W-30 4L",
    price: 72082,
  },
  {
    vendorCode: "152564",
    title: "Масло моторное 4L Super 3000 X1 Formula FE 5W30 син.",
    price: 7831,
  },
  {
    vendorCode: "102784",
    title: "Масло моторное 5w-40 / 8100 X-cess 1L MOTUL",
    price: 73988,
  },
  {
    vendorCode: "83212365929",
    title: "Масло моторное Twin Power Turbo 0W-30, 1L",
    price: 9072,
  },
  {
    vendorCode: "83212365925",
    title: "Масло моторное Twin Power Turbo Longlife-01 0W-40, 1L",
    price: 67045,
  },
  {
    vendorCode: "83212365933",
    title: "Масло моторное Twinpower Turbo Oil Longlife-04 5W-30 1L",
    price: 17994,
  },
  {
    vendorCode: "14E9D1",
    title: "Масло моторное Formula S/SD 5W-405л",
    price: 49540,
  },
  {
    vendorCode: "15800D",
    title: "Масло моторное FORD-Castrol 5W-20 5л",
    price: 70230,
  },
  {
    vendorCode: "157B77",
    title: "Масло моторное FORD-Castrol 5W-30 5 л ",
    price: 15319,
  },
  {
    vendorCode: "1942002",
    title: "Масло моторное 5W-30 4л",
    price: 45024,
  },
  {
    vendorCode: "1942003",
    title: "Масло моторное DEXOS 2 5W-30 5L",
    price: 31156,
  },
  {
    vendorCode: "93165557",
    title: "Масло моторное Dexos 2 5w-30 5L",
    price: 76736,
  },
  {
    vendorCode: "95599405",
    title: "Масло моторное DEXOS 2 5W-30 5L",
    price: 5316,
  },
  {
    vendorCode: "95599404",
    title: "Масло моторное Dexos2 5w-30 4L",
    price: 71782,
  },
  {
    vendorCode: "0510000410",
    title: "Масло моторное HYUNDAI Super Extra 5W-30, 4L",
    price: 80056,
  },
  {
    vendorCode: "0510000451",
    title: "Масло моторное HYUNDAI/KIA 5W-20 Premium LF(4L",
    price: 62897,
  },
  {
    vendorCode: "053005TFE",
    title: "Масло моторное MAZDA Dexelia Ultra 5W-30 5L",
    price: 9442,
  },
  {
    vendorCode: "830077992",
    title: "Масло моторное MAZDA ORIGINAL OIL ULTRA 5W-30 5л",
    price: 18826,
  },
  {
    vendorCode: "0009898201AAA4",
    title: "Масло моторное 229.3 5W-40 5L",
    price: 33483,
  },
  {
    vendorCode: "0009898301AAA6",
    title: "Масло моторное MERCEDES 5W-40 1L",
    price: 29909,
  },
  {
    vendorCode: "0009898301AAA4",
    title: "Масло моторное MERCEDES BENZ 5W-40 MB229.5 5L",
    price: 67241,
  },
  {
    vendorCode: "0009899701AAA6",
    title: "Масло моторное MB 229.51 5W-30 1L",
    price: 27727,
  },
  {
    vendorCode: "0009899701AAA4",
    title: "Масло моторное MERCEDES MB 229.51 5w30 5L",
    price: 53632,
  },
  {
    vendorCode: "MZ320757",
    title: "Масло моторное 5W-30 API SM/CF4л)",
    price: 80726,
  },
  {
    vendorCode: "MZ320754",
    title: "Масло моторное Moto 0W30 4L",
    price: 59576,
  },
  {
    vendorCode: "152622",
    title: "Масло моторное Mobil 1 ESP Formula 5W-30 1л",
    price: 50613,
  },
  {
    vendorCode: "152621",
    title: "Масло моторное Mobil 1 ESP Formula 5W-30 4л",
    price: 46099,
  },
  {
    vendorCode: "152567",
    title: "Масло моторное Mobil Super 3000 X1 5W-40 1л",
    price: 56971,
  },
  {
    vendorCode: "152566",
    title: "Масло моторное Mobil Super 3000 X1 5W-40 4л",
    price: 1588,
  },
  {
    vendorCode: "KE90090042",
    title: "Масло моторное Nissan 5W-40, 5L",
    price: 78180,
  },
  {
    vendorCode: "KE90090042VA",
    title: "Масло моторное VALUE ADVANTAGE 3+ 5W-40 5L",
    price: 1022,
  },
  {
    vendorCode: "93165556",
    title: "Масло моторное OPEL 5w30/SM 4л",
    price: 12689,
  },
  {
    vendorCode: "99M0021R01004",
    title: "Масло моторное MOTOR OIL 0W20, 4л",
    price: 43652,
  },
  {
    vendorCode: "99M0021R02004",
    title: "Масло моторное MOTOR OIL 5W30, 4л.",
    price: 67990,
  },
  {
    vendorCode: "0888083265GO",
    title: "Масло моторное 0W-20 5л",
    price: 7369,
  },
  {
    vendorCode: "0888080365GO",
    title: "Масло моторное 0W-30 5L",
    price: 48009,
  },
  {
    vendorCode: "0888080375GO",
    title: "Масло моторное 5W-40 SM/CF, A3/B3/B4 5L",
    price: 55383,
  },
  {
    vendorCode: "0888080845",
    title: "Масло моторное SN 5W-30 5л",
    price: 21973,
  },
  {
    vendorCode: "G052195M4",
    title: "Масло моторное LongLife 5W-30 5L",
    price: 27896,
  },
  {
    vendorCode: "15595A",
    title: "Масло моторное синт. A5/B5, WSS-M2C913-C 1L",
    price: 61065,
  },
  {
    vendorCode: "0821799974",
    title: "Масло моторное синт. Ultra LEO-SN 0W-20 4L",
    price: 28942,
  },
  {
    vendorCode: "15595E",
    title: "Масло моторное синтетика 5W-30 FORMULA F SM/CF A1/B1 5л",
    price: 9956,
  },
  {
    vendorCode: "550040295",
    title: "Масло моторное синтетическое 4л - API: SN/CF, ACEA",
    price: 17875,
  },
  {
    vendorCode: "550040542",
    title: "Масло моторное синтетическое 4л - API: SN/CF, ACEA",
    price: 13167,
  },
  {
    vendorCode: "KE90099943R",
    title: "Масло моторное синтетическое Nissan 5W-30 5л",
    price: 40165,
  },
  {
    vendorCode: "0520000620",
    title: "Масло моторное синтетическое Premium DPF Diesel 5W-30, 6л",
    price: 16599,
  },
  {
    vendorCode: "155D3A",
    title: "Масло моторное, 5 л., 5w-30 , Formula F",
    price: 47852,
  },
  {
    vendorCode: "83222409710",
    title: "Масло транс. DTF-1 1 л",
    price: 8980,
  },
  {
    vendorCode: "1790199",
    title: "Масло транс. 75W-90 1L",
    price: 86639,
  },
  {
    vendorCode: "XT10QLVC",
    title: "Масло транс. MERCON-LV 1L",
    price: 9081,
  },
  {
    vendorCode: "93165414",
    title: "Масло транс. ATF Dexron VI 1L",
    price: 85750,
  },
  {
    vendorCode: "0450000400",
    title: "Масло транс. HYUNDAI ATF SP-III 4L",
    price: 28245,
  },
  {
    vendorCode: "0450000100",
    title: "Масло транс. HYUNDAI ATF SP-III1л)",
    price: 99039,
  },
  {
    vendorCode: "KLE5200004",
    title: "Масло транс. CVT NS-24л",
    price: 63983,
  },
  {
    vendorCode: "0450000115",
    title: "МАСЛО ТРАНСМИССИОННОЕ ДЛЯ АКПП ATF SP-IV (8 speed), МИНЕРАЛЬНОЕ, ЕМК.",
    price: 96097,
  },
  {
    vendorCode: "S0001610",
    title: "МАСЛО ТРАНСМИССИОННОЕ ПОЛУСИНТЕТИЧЕСКОЕ DIAQUEEN CVT FLUID J1, 4L",
    price: 45357,
  },
  {
    vendorCode: "30015046746",
    title: "Моторное масло F-S 5W-40 SN/CF 4л",
    price: 38289,
  },
  {
    vendorCode: "0510000441",
    title: "Моторное масло HYUNDAI 5W-30 4L",
    price: 18946,
  },
  {
    vendorCode: "KE90090042R",
    title: "Моторное масло 5W-40 5L",
    price: 55224,
  },
  {
    vendorCode: "10925019",
    title: "Моторное масло WR SAE 5W-40 (5л)",
    price: 32782,
  },
  {
    vendorCode: "550040315",
    title: "Моторное масло Helix HX7 SAE 10W-40 (4л)",
    price: 15911,
  },
  {
    vendorCode: "550040755",
    title: "Моторное масло Helix Ultra SAE 5W-40 (4л)",
    price: 37778,
  },
  {
    vendorCode: "1845004",
    title: "Моторное масло ZEPRO TOURING 5W30 SN/GF-5 4L",
    price: 62512,
  },
  {
    vendorCode: "4014835795419",
    title: "Трансмиссионное масло Transfer Fluid TF-0870 (1л)",
    price: 38978,
  },
  {
    vendorCode: "S671090255",
    title: "Трансмиссионное масло; Масло автоматической коробки передач",
    price: 71211,
  },
  {
    vendorCode: "KE90999945R",
    title: "ТРАНСМИССИОННОЕ МАСЛО",
    price: 17351,
  },
  {
    vendorCode: "2E0601019H",
    title: "Диск колёсный 5.5Jx16 HMA117 6/205 VW CRAFTER",
    price: 29699,
  },
  {
    vendorCode: "DWK-004",
    title: "Компл.сцепления OPEL 1.6-1.8L KADETT E/ASCONA 200mm /DAEWO NEXIA 1.5L 95=>",
    price: 54292,
  },
  {
    vendorCode: "2015846",
    title: "МОДУЛЬ ECU FOCUS 2011- / ECOSPORT 2013-",
    price: 32054,
  },
  {
    vendorCode: "94535807",
    title: "Палец вилки механизма переключения передач",
    price: 59025,
  },
  {
    vendorCode: "7701208174",
    title: "ЭЛ МАГН КЛАПАН АКПП",
    price: 19634,
  },
  {
    vendorCode: "KR8888M",
    title: "Модуль в сборе с бензонасосом",
    price: 37486,
  },
  {
    vendorCode: "1778516",
    title: "Насос системы охлаждения, Zetec-S",
    price: 562,
  },
  {
    vendorCode: "341651BA",
    title: "Радиатор DAEWOO NEXIA 1.5L-16V МКПП АС- 94-98",
    price: 60902,
  },
  {
    vendorCode: "13370133",
    title: "РАСШИРИТЕЛЬНЫЙ БАЧОК СИСТЕМЫ ОХЛАЖДЕНИЯ",
    price: 56204,
  },
  {
    vendorCode: "1336180",
    title: "Подкрылок передний правый. [ORG1]",
    price: 8179,
  },
  {
    vendorCode: "1359240",
    title: "Локер передний левый [ORG1]",
    price: 69571,
  },
  {
    vendorCode: "8659028000",
    title: "ФИКСАТОР ПАНЕЛИ БАМПЕРА",
    price: 46435,
  },
  {
    vendorCode: "5Q0411315A",
    title: "Тяга пер.стабил.AUDI A3/TOURAN/PASSAT/GOLF V 2003=>",
    price: 49997,
  },
  {
    vendorCode: "392414459R",
    title: "ЧЕХОЛ ПОЛУОСИ (РЕЗ)",
    price: 1365,
  },
  {
    vendorCode: "70-31414-10",
    title: "Герметик REINZOSIL 70мл. универсальный,термостойкий",
    price: 52380,
  },
  {
    vendorCode: "MZ100139EX",
    title: "ОЧИСТИТЕЛЬ ДВИГАТЕЛЯ GDI",
    price: 76647,
  },
  {
    vendorCode: "850100",
    title: "Очиститель для рук Чистая звезда 11 л",
    price: 58598,
  },
  {
    vendorCode: "W76695",
    title: "Промывка Injection System Purge 12x1L (очист. бенз. инжек. сис.)",
    price: 54328,
  },
  {
    vendorCode: "93741069",
    title: "КОНТАКТНАЯ ГРУППА ЗАМКА ЗАЖИГАНИЯ",
    price: 18096,
  },
  {
    vendorCode: "9673999980",
    title: "Реле",
    price: 86638,
  },
];

const STATUS = [
    "new",
    "calculation",
    "confirmed",
    "postponed",
    "completed",
    "declined",
  ];